---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.GetFabricSheetsInHost
source: html/ccdf094f-6198-3720-14c3-1fe3f131e6fe.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.GetFabricSheetsInHost Method

Returns all FabricSheet elements hosted by the referenced element.

## Syntax (C#)
```csharp
public IList<FabricSheet> GetFabricSheetsInHost()
```